# Pandas

First we need to install pandas in case we don't have it

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages (0.20.2)
Requirement already satisfied: numpy>=1.7.0 in /Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages (from pandas) (1.9.2)
Requirement already satisfied: python-dateutil in /Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages (from pandas) (2.6.0)
Requirement already satisfied: pytz>=2011k in /Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages (from pandas) (2017.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages (from python-dateutil->pandas) (1.10.0)
You are using pip version 18.0, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

Then we need to import pandas and name it pd

In [2]:
import pandas as pd

How to read data from a csv file?  
**Note** csv file must be in the same directory as your ptyhon or Ipython file

In [3]:
df = pd.read_csv('salaries.csv')

In [4]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

in pandas data frame we can index a column by it's name

In [5]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

or even multiple columns

In [6]:
df[['Name','Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

We can perform operations:

In [7]:
df['Age'].mean()

35.333333333333336

We can filter:

In [8]:
df['Age'] > 30

0     True
1     True
2    False
Name: Age, dtype: bool

In [9]:
age_filter = df['Age'] > 30
df[age_filter]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

Or

In [10]:
df[df['Age']>30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45